#include <iostream>
using namespace std;

int main()
{
    // x - задане дійсне число
    // f - значення функції
    double x;
    int f;

    // Вводимо x
    cin >> x;

    // Якщо x менше нуля
    if (x < 0)
    {
        f = 0;
    }
    else
    {
        // Знаходимо цілу частину x
        int n = (int)x;

        // Для проміжків [0,1), [2,3), ... значення 1
        if (n % 2 == 0)
            f = 1;
        else
            // Для проміжків [1,2), [3,4), ... значення -1
            f = -1;
    }

    // Виводимо результат
    cout << "f = " << f << endl;

    return 0;
}
